NACA0012-DES/0/nut
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                                |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox         |
|  \\    /   O peration     | Version:  v2412                               |
|   \\  /    A nd           | Web:      www.openfoam.com                    |
|    \\/     M anipulation  |                                                |
\*-----------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Turbulent viscosity, derived quantity: nut = k/omega = 0.84375/27.56
dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.030616;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.030616;
    }

    outlet
    {
        type            calculated;
        value           uniform 0.030616;
    }

    airfoil
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
