NACA0012-DES/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       18960;
    }
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       19200;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       19320;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9600;
        startFace       19440;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9600;
        startFace       29040;
    }
)

// ************************************************************************* //
