NACA0012-DES/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                                |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox         |
|  \\    /   O peration     | Version:  v2412                               |
|   \\  /    A nd           | Web:      www.openfoam.com                    |
|    \\/     M anipulation  |                                                |
\*-----------------------------------------------------------------------*/
// AUTO-GENERATED by system/makeBlockMeshDict.py -- do not hand-edit.
// Regenerate with: python3 system/makeBlockMeshDict.py
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(

    (0.00000000 0.00000000 0.00000000) // 0 le0
    (0.50994109 0.05221695 0.00000000) // 1 topMid0
    (1.00000000 -0.00000000 0.00000000) // 2 te0
    (0.50994109 -0.05221695 0.00000000) // 3 botMid0
    (-19.50000000 0.00000000 0.00000000) // 4 outerFront0
    (0.50000000 20.00000000 0.00000000) // 5 outerTop0
    (20.50000000 0.00000000 0.00000000) // 6 outerBack0
    (0.50000000 -20.00000000 0.00000000) // 7 outerBot0
    (0.00000000 0.00000000 0.10000000) // 8 le1
    (0.50994109 0.05221695 0.10000000) // 9 topMid1
    (1.00000000 -0.00000000 0.10000000) // 10 te1
    (0.50994109 -0.05221695 0.10000000) // 11 botMid1
    (-19.50000000 0.00000000 0.10000000) // 12 outerFront1
    (0.50000000 20.00000000 0.10000000) // 13 outerTop1
    (20.50000000 0.00000000 0.10000000) // 14 outerBack1
    (0.50000000 -20.00000000 0.10000000) // 15 outerBot1
);

blocks
(
    hex (0 1 5 4 8 9 13 12) (60 40 1) simpleGrading (1 400.0 1) // front
    hex (1 2 6 5 9 10 14 13) (60 40 1) simpleGrading (1 400.0 1) // top
    hex (2 3 7 6 10 11 15 14) (60 40 1) simpleGrading (1 400.0 1) // back
    hex (3 0 4 7 11 8 12 15) (60 40 1) simpleGrading (1 400.0 1) // bottom
);

edges
(
    spline 0 1
    (
            (0.00039530 0.00351190 0.00000000)
            (0.00158058 0.00696221 0.00000000)
            (0.00355396 0.01034850 0.00000000)
            (0.00631233 0.01366768 0.00000000)
            (0.00985132 0.01691600 0.00000000)
            (0.01416533 0.02008915 0.00000000)
            (0.01924755 0.02318229 0.00000000)
            (0.02508993 0.02619009 0.00000000)
            (0.03168325 0.02910689 0.00000000)
            (0.03901707 0.03192668 0.00000000)
            (0.04707980 0.03464327 0.00000000)
            (0.05585869 0.03725037 0.00000000)
            (0.06533986 0.03974165 0.00000000)
            (0.07550832 0.04211089 0.00000000)
            (0.08634798 0.04435203 0.00000000)
            (0.09784172 0.04645931 0.00000000)
            (0.10997135 0.04842731 0.00000000)
            (0.12271769 0.05025109 0.00000000)
            (0.13606059 0.05192620 0.00000000)
            (0.14997896 0.05344882 0.00000000)
            (0.16445079 0.05481576 0.00000000)
            (0.17945318 0.05602454 0.00000000)
            (0.19496243 0.05707338 0.00000000)
            (0.21095400 0.05796131 0.00000000)
            (0.22740261 0.05868809 0.00000000)
            (0.24428226 0.05925426 0.00000000)
            (0.26156625 0.05966114 0.00000000)
            (0.27922725 0.05991077 0.00000000)
            (0.29723734 0.06000592 0.00000000)
            (0.31556804 0.05995001 0.00000000)
            (0.33419036 0.05974713 0.00000000)
            (0.35307486 0.05940192 0.00000000)
            (0.37219168 0.05891953 0.00000000)
            (0.39151060 0.05830560 0.00000000)
            (0.41100105 0.05756614 0.00000000)
            (0.43063223 0.05670753 0.00000000)
            (0.45037310 0.05573639 0.00000000)
            (0.47019244 0.05465956 0.00000000)
            (0.49005891 0.05348405 0.00000000)
    )
    spline 1 2
    (
            (0.52980756 0.05086542 0.00000000)
            (0.54962690 0.04943662 0.00000000)
            (0.56936777 0.04793767 0.00000000)
            (0.58899895 0.04637565 0.00000000)
            (0.60848940 0.04475754 0.00000000)
            (0.62780832 0.04309023 0.00000000)
            (0.64692514 0.04138048 0.00000000)
            (0.66580964 0.03963493 0.00000000)
            (0.68443196 0.03786011 0.00000000)
            (0.70276266 0.03606243 0.00000000)
            (0.72077275 0.03424818 0.00000000)
            (0.73843375 0.03242356 0.00000000)
            (0.75571774 0.03059466 0.00000000)
            (0.77259739 0.02876751 0.00000000)
            (0.78904600 0.02694809 0.00000000)
            (0.80503757 0.02514230 0.00000000)
            (0.82054682 0.02335602 0.00000000)
            (0.83554921 0.02159511 0.00000000)
            (0.85002104 0.01986536 0.00000000)
            (0.86393941 0.01817258 0.00000000)
            (0.87728231 0.01652253 0.00000000)
            (0.89002865 0.01492093 0.00000000)
            (0.90215828 0.01337345 0.00000000)
            (0.91365202 0.01188570 0.00000000)
            (0.92449168 0.01046319 0.00000000)
            (0.93466014 0.00911133 0.00000000)
            (0.94414131 0.00783536 0.00000000)
            (0.95292020 0.00664035 0.00000000)
            (0.96098293 0.00553117 0.00000000)
            (0.96831675 0.00451241 0.00000000)
            (0.97491007 0.00358840 0.00000000)
            (0.98075245 0.00276311 0.00000000)
            (0.98583467 0.00204017 0.00000000)
            (0.99014868 0.00142279 0.00000000)
            (0.99368767 0.00091375 0.00000000)
            (0.99644604 0.00051538 0.00000000)
            (0.99841942 0.00022950 0.00000000)
            (0.99960470 0.00005744 0.00000000)
    )
    spline 2 3
    (
            (0.99960470 -0.00005744 0.00000000)
            (0.99841942 -0.00022950 0.00000000)
            (0.99644604 -0.00051538 0.00000000)
            (0.99368767 -0.00091375 0.00000000)
            (0.99014868 -0.00142279 0.00000000)
            (0.98583467 -0.00204017 0.00000000)
            (0.98075245 -0.00276311 0.00000000)
            (0.97491007 -0.00358840 0.00000000)
            (0.96831675 -0.00451241 0.00000000)
            (0.96098293 -0.00553117 0.00000000)
            (0.95292020 -0.00664035 0.00000000)
            (0.94414131 -0.00783536 0.00000000)
            (0.93466014 -0.00911133 0.00000000)
            (0.92449168 -0.01046319 0.00000000)
            (0.91365202 -0.01188570 0.00000000)
            (0.90215828 -0.01337345 0.00000000)
            (0.89002865 -0.01492093 0.00000000)
            (0.87728231 -0.01652253 0.00000000)
            (0.86393941 -0.01817258 0.00000000)
            (0.85002104 -0.01986536 0.00000000)
            (0.83554921 -0.02159511 0.00000000)
            (0.82054682 -0.02335602 0.00000000)
            (0.80503757 -0.02514230 0.00000000)
            (0.78904600 -0.02694809 0.00000000)
            (0.77259739 -0.02876751 0.00000000)
            (0.75571774 -0.03059466 0.00000000)
            (0.73843375 -0.03242356 0.00000000)
            (0.72077275 -0.03424818 0.00000000)
            (0.70276266 -0.03606243 0.00000000)
            (0.68443196 -0.03786011 0.00000000)
            (0.66580964 -0.03963493 0.00000000)
            (0.64692514 -0.04138048 0.00000000)
            (0.62780832 -0.04309023 0.00000000)
            (0.60848940 -0.04475754 0.00000000)
            (0.58899895 -0.04637565 0.00000000)
            (0.56936777 -0.04793767 0.00000000)
            (0.54962690 -0.04943662 0.00000000)
            (0.52980756 -0.05086542 0.00000000)
    )
    spline 3 0
    (
            (0.49005891 -0.05348405 0.00000000)
            (0.47019244 -0.05465956 0.00000000)
            (0.45037310 -0.05573639 0.00000000)
            (0.43063223 -0.05670753 0.00000000)
            (0.41100105 -0.05756614 0.00000000)
            (0.39151060 -0.05830560 0.00000000)
            (0.37219168 -0.05891953 0.00000000)
            (0.35307486 -0.05940192 0.00000000)
            (0.33419036 -0.05974713 0.00000000)
            (0.31556804 -0.05995001 0.00000000)
            (0.29723734 -0.06000592 0.00000000)
            (0.27922725 -0.05991077 0.00000000)
            (0.26156625 -0.05966114 0.00000000)
            (0.24428226 -0.05925426 0.00000000)
            (0.22740261 -0.05868809 0.00000000)
            (0.21095400 -0.05796131 0.00000000)
            (0.19496243 -0.05707338 0.00000000)
            (0.17945318 -0.05602454 0.00000000)
            (0.16445079 -0.05481576 0.00000000)
            (0.14997896 -0.05344882 0.00000000)
            (0.13606059 -0.05192620 0.00000000)
            (0.12271769 -0.05025109 0.00000000)
            (0.10997135 -0.04842731 0.00000000)
            (0.09784172 -0.04645931 0.00000000)
            (0.08634798 -0.04435203 0.00000000)
            (0.07550832 -0.04211089 0.00000000)
            (0.06533986 -0.03974165 0.00000000)
            (0.05585869 -0.03725037 0.00000000)
            (0.04707980 -0.03464327 0.00000000)
            (0.03901707 -0.03192668 0.00000000)
            (0.03168325 -0.02910689 0.00000000)
            (0.02508993 -0.02619009 0.00000000)
            (0.01924755 -0.02318229 0.00000000)
            (0.01416533 -0.02008915 0.00000000)
            (0.00985132 -0.01691600 0.00000000)
            (0.00631233 -0.01366768 0.00000000)
            (0.00355396 -0.01034850 0.00000000)
            (0.00158058 -0.00696221 0.00000000)
            (0.00039530 -0.00351190 0.00000000)
    )
    arc 4 5 (-13.64213562 14.14213562 0.00000000)
    arc 5 6 (14.64213562 14.14213562 0.00000000)
    arc 6 7 (14.64213562 -14.14213562 0.00000000)
    arc 7 4 (-13.64213562 -14.14213562 0.00000000)
    spline 8 9
    (
            (0.00039530 0.00351190 0.10000000)
            (0.00158058 0.00696221 0.10000000)
            (0.00355396 0.01034850 0.10000000)
            (0.00631233 0.01366768 0.10000000)
            (0.00985132 0.01691600 0.10000000)
            (0.01416533 0.02008915 0.10000000)
            (0.01924755 0.02318229 0.10000000)
            (0.02508993 0.02619009 0.10000000)
            (0.03168325 0.02910689 0.10000000)
            (0.03901707 0.03192668 0.10000000)
            (0.04707980 0.03464327 0.10000000)
            (0.05585869 0.03725037 0.10000000)
            (0.06533986 0.03974165 0.10000000)
            (0.07550832 0.04211089 0.10000000)
            (0.08634798 0.04435203 0.10000000)
            (0.09784172 0.04645931 0.10000000)
            (0.10997135 0.04842731 0.10000000)
            (0.12271769 0.05025109 0.10000000)
            (0.13606059 0.05192620 0.10000000)
            (0.14997896 0.05344882 0.10000000)
            (0.16445079 0.05481576 0.10000000)
            (0.17945318 0.05602454 0.10000000)
            (0.19496243 0.05707338 0.10000000)
            (0.21095400 0.05796131 0.10000000)
            (0.22740261 0.05868809 0.10000000)
            (0.24428226 0.05925426 0.10000000)
            (0.26156625 0.05966114 0.10000000)
            (0.27922725 0.05991077 0.10000000)
            (0.29723734 0.06000592 0.10000000)
            (0.31556804 0.05995001 0.10000000)
            (0.33419036 0.05974713 0.10000000)
            (0.35307486 0.05940192 0.10000000)
            (0.37219168 0.05891953 0.10000000)
            (0.39151060 0.05830560 0.10000000)
            (0.41100105 0.05756614 0.10000000)
            (0.43063223 0.05670753 0.10000000)
            (0.45037310 0.05573639 0.10000000)
            (0.47019244 0.05465956 0.10000000)
            (0.49005891 0.05348405 0.10000000)
    )
    spline 9 10
    (
            (0.52980756 0.05086542 0.10000000)
            (0.54962690 0.04943662 0.10000000)
            (0.56936777 0.04793767 0.10000000)
            (0.58899895 0.04637565 0.10000000)
            (0.60848940 0.04475754 0.10000000)
            (0.62780832 0.04309023 0.10000000)
            (0.64692514 0.04138048 0.10000000)
            (0.66580964 0.03963493 0.10000000)
            (0.68443196 0.03786011 0.10000000)
            (0.70276266 0.03606243 0.10000000)
            (0.72077275 0.03424818 0.10000000)
            (0.73843375 0.03242356 0.10000000)
            (0.75571774 0.03059466 0.10000000)
            (0.77259739 0.02876751 0.10000000)
            (0.78904600 0.02694809 0.10000000)
            (0.80503757 0.02514230 0.10000000)
            (0.82054682 0.02335602 0.10000000)
            (0.83554921 0.02159511 0.10000000)
            (0.85002104 0.01986536 0.10000000)
            (0.86393941 0.01817258 0.10000000)
            (0.87728231 0.01652253 0.10000000)
            (0.89002865 0.01492093 0.10000000)
            (0.90215828 0.01337345 0.10000000)
            (0.91365202 0.01188570 0.10000000)
            (0.92449168 0.01046319 0.10000000)
            (0.93466014 0.00911133 0.10000000)
            (0.94414131 0.00783536 0.10000000)
            (0.95292020 0.00664035 0.10000000)
            (0.96098293 0.00553117 0.10000000)
            (0.96831675 0.00451241 0.10000000)
            (0.97491007 0.00358840 0.10000000)
            (0.98075245 0.00276311 0.10000000)
            (0.98583467 0.00204017 0.10000000)
            (0.99014868 0.00142279 0.10000000)
            (0.99368767 0.00091375 0.10000000)
            (0.99644604 0.00051538 0.10000000)
            (0.99841942 0.00022950 0.10000000)
            (0.99960470 0.00005744 0.10000000)
    )
    spline 10 11
    (
            (0.99960470 -0.00005744 0.10000000)
            (0.99841942 -0.00022950 0.10000000)
            (0.99644604 -0.00051538 0.10000000)
            (0.99368767 -0.00091375 0.10000000)
            (0.99014868 -0.00142279 0.10000000)
            (0.98583467 -0.00204017 0.10000000)
            (0.98075245 -0.00276311 0.10000000)
            (0.97491007 -0.00358840 0.10000000)
            (0.96831675 -0.00451241 0.10000000)
            (0.96098293 -0.00553117 0.10000000)
            (0.95292020 -0.00664035 0.10000000)
            (0.94414131 -0.00783536 0.10000000)
            (0.93466014 -0.00911133 0.10000000)
            (0.92449168 -0.01046319 0.10000000)
            (0.91365202 -0.01188570 0.10000000)
            (0.90215828 -0.01337345 0.10000000)
            (0.89002865 -0.01492093 0.10000000)
            (0.87728231 -0.01652253 0.10000000)
            (0.86393941 -0.01817258 0.10000000)
            (0.85002104 -0.01986536 0.10000000)
            (0.83554921 -0.02159511 0.10000000)
            (0.82054682 -0.02335602 0.10000000)
            (0.80503757 -0.02514230 0.10000000)
            (0.78904600 -0.02694809 0.10000000)
            (0.77259739 -0.02876751 0.10000000)
            (0.75571774 -0.03059466 0.10000000)
            (0.73843375 -0.03242356 0.10000000)
            (0.72077275 -0.03424818 0.10000000)
            (0.70276266 -0.03606243 0.10000000)
            (0.68443196 -0.03786011 0.10000000)
            (0.66580964 -0.03963493 0.10000000)
            (0.64692514 -0.04138048 0.10000000)
            (0.62780832 -0.04309023 0.10000000)
            (0.60848940 -0.04475754 0.10000000)
            (0.58899895 -0.04637565 0.10000000)
            (0.56936777 -0.04793767 0.10000000)
            (0.54962690 -0.04943662 0.10000000)
            (0.52980756 -0.05086542 0.10000000)
    )
    spline 11 8
    (
            (0.49005891 -0.05348405 0.10000000)
            (0.47019244 -0.05465956 0.10000000)
            (0.45037310 -0.05573639 0.10000000)
            (0.43063223 -0.05670753 0.10000000)
            (0.41100105 -0.05756614 0.10000000)
            (0.39151060 -0.05830560 0.10000000)
            (0.37219168 -0.05891953 0.10000000)
            (0.35307486 -0.05940192 0.10000000)
            (0.33419036 -0.05974713 0.10000000)
            (0.31556804 -0.05995001 0.10000000)
            (0.29723734 -0.06000592 0.10000000)
            (0.27922725 -0.05991077 0.10000000)
            (0.26156625 -0.05966114 0.10000000)
            (0.24428226 -0.05925426 0.10000000)
            (0.22740261 -0.05868809 0.10000000)
            (0.21095400 -0.05796131 0.10000000)
            (0.19496243 -0.05707338 0.10000000)
            (0.17945318 -0.05602454 0.10000000)
            (0.16445079 -0.05481576 0.10000000)
            (0.14997896 -0.05344882 0.10000000)
            (0.13606059 -0.05192620 0.10000000)
            (0.12271769 -0.05025109 0.10000000)
            (0.10997135 -0.04842731 0.10000000)
            (0.09784172 -0.04645931 0.10000000)
            (0.08634798 -0.04435203 0.10000000)
            (0.07550832 -0.04211089 0.10000000)
            (0.06533986 -0.03974165 0.10000000)
            (0.05585869 -0.03725037 0.10000000)
            (0.04707980 -0.03464327 0.10000000)
            (0.03901707 -0.03192668 0.10000000)
            (0.03168325 -0.02910689 0.10000000)
            (0.02508993 -0.02619009 0.10000000)
            (0.01924755 -0.02318229 0.10000000)
            (0.01416533 -0.02008915 0.10000000)
            (0.00985132 -0.01691600 0.10000000)
            (0.00631233 -0.01366768 0.10000000)
            (0.00355396 -0.01034850 0.10000000)
            (0.00158058 -0.00696221 0.10000000)
            (0.00039530 -0.00351190 0.10000000)
    )
    arc 12 13 (-13.64213562 14.14213562 0.10000000)
    arc 13 14 (14.64213562 14.14213562 0.10000000)
    arc 14 15 (14.64213562 -14.14213562 0.10000000)
    arc 15 12 (-13.64213562 -14.14213562 0.10000000)
);

boundary
(
    airfoil
    {
        type wall;
        faces
        (
        (0 1 9 8)
        (1 2 10 9)
        (2 3 11 10)
        (3 0 8 11)
        );
    }
    inlet
    {
        type patch;
        faces
        (
        (4 5 13 12)
        (7 4 12 15)
        );
    }
    outlet
    {
        type patch;
        faces
        (
        (5 6 14 13)
        (6 7 15 14)
        );
    }
    front
    {
        type empty;
        faces
        (
        (0 4 5 1)
        (1 5 6 2)
        (2 6 7 3)
        (3 7 4 0)
        );
    }
    back
    {
        type empty;
        faces
        (
        (8 9 13 12)
        (9 10 14 13)
        (10 11 15 14)
        (11 8 12 15)
        );
    }
);

// ************************************************************************* //
