NACA0012-DES/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                                |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox         |
|  \\    /   O peration     | Version:  v2412                               |
|   \\  /    A nd           | Web:      www.openfoam.com                    |
|    \\/     M anipulation  |                                                |
\*-----------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    // DES requires a transient, 2nd-order-accurate time scheme.
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    // LUST: a low-dissipation blend of linear-upwind and central
    // differencing, standard choice for LES/DES momentum convection --
    // keeps enough upwinding for stability without smearing resolved eddies.
    div(phi,U)          Gauss LUST grad(U);

    // Bounded upwind for the turbulence transport quantities is fine --
    // these don't need to be low-dissipation the way U does.
    div(phi,k)          Gauss upwind;
    div(phi,omega)      Gauss upwind;
    div(phi,nuTilda)    Gauss upwind;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //
