NACA0012-DES/system/fvSolution
/*--------------------------------*- C++ -*----------------------------*\
| =========                 |                                                |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox         |
|  \\    /   O peration     | Version:  v2412                               |
|   \\  /    A nd           | Web:      www.openfoam.com                    |
|    \\/     M anipulation  |                                                |
\*-----------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(U|k|omega)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    2;
    nCorrectors         1;
    // Mesh has some cells with non-orthogonality up to ~80 deg near the
    // leading/trailing edge (see checkMesh) -- 2 correctors improves
    // robustness of the pressure solve on those cells.
    nNonOrthogonalCorrectors 2;
    pRefCell            0;
    pRefValue           0;

    residualControl
    {
        U
        {
            tolerance   1e-5;
            relTol      0;
        }
        p
        {
            tolerance   1e-5;
            relTol      0;
        }
        k
        {
            tolerance   1e-5;
            relTol      0;
        }
        omega
        {
            tolerance   1e-5;
            relTol      0;
        }
    }
}

relaxationFactors
{
    equations
    {
        // Mild under-relaxation on the outer PIMPLE loop for robustness;
        // the *Final solves above use relTol 0 (fully converged) each step.
        ".*"            0.9;
    }
}

// ************************************************************************* //
